XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAMDA1_DFP.pdsc
      <condition id="ATSAMDA1E14B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1E14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1J15A">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1J15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1J14A">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1J14A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1E15B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1E15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1J15B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1J15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1J14B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1J14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1G15A">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1G15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1E15A">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1E15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1J16A">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1J16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1G15B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1G15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1G14B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1G14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1G14A">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1G14A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1G16A">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1G16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1G16B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1G16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1J16B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1J16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1E16B">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1E16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMDA1E16A">
         <require Dvendor="Microchip:3" Dname="ATSAMDA1E16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMDA1E14A">
         <description>Headers and startup code for Microchip ATSAMDA1E14A</description>
         <files>
            <file condition="C" category="include" name="samda1/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samda1/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1/gcc/system_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1/gcc/gcc/startup_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samda1/gcc/gcc/samda1e14a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samda1/gcc/gcc/samda1e14a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_samda1.s"
                  attr="config"/>   <!-- changed by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_samda1.c"
                  attr="config"/>   <!-- changed by ARM -->
            <file condition="IAR Exe"
                  category="source"
                  name="samda1/iar/system_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samda1/iar/iar/startup_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samda1/iar/iar/samda1e14a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samda1/iar/iar/samda1e14a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMDA1E14B">
         <description>Headers and startup code for Microchip ATSAMDA1E14B</description>
         <files>
            <file condition="C" category="include" name="samda1b/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samda1b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1b/gcc/system_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1b/gcc/gcc/startup_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samda1b/gcc/gcc/samda1e14b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samda1b/gcc/gcc/samda1e14b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_samda1.s"
                  attr="config"/>   <!-- changed by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_samda1.c"
                  attr="config"/>   <!-- changed by ARM -->
            <file condition="IAR Exe"
                  category="source"
                  name="samda1b/iar/system_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samda1b/iar/iar/startup_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samda1b/iar/iar/samda1e14b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samda1b/iar/iar/samda1e14b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMDA1J15A">
         <description>Headers and startup code for Microchip ATSAMDA1J15A</description>
         <files>
            <file condition="C" category="include" name="samda1/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samda1/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1/gcc/system_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1/gcc/gcc/startup_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samda1/gcc/gcc/samda1j15a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samda1/gcc/gcc/samda1j15a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_samda1.s"
                  attr="config"/>   <!-- changed by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_samda1.c"
                  attr="config"/>   <!-- changed by ARM -->
            <file condition="IAR Exe"
                  category="source"
                  name="samda1/iar/system_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samda1/iar/iar/startup_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samda1/iar/iar/samda1j15a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samda1/iar/iar/samda1j15a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMDA1J14A">
         <description>Headers and startup code for Microchip ATSAMDA1J14A</description>
         <files>
            <file condition="C" category="include" name="samda1/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samda1/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1/gcc/system_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1/gcc/gcc/startup_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samda1/gcc/gcc/samda1j14a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samda1/gcc/gcc/samda1j14a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_samda1.s"
                  attr="config"/>   <!-- changed by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_samda1.c"
                  attr="config"/>   <!-- changed by ARM -->
            <file condition="IAR Exe"
                  category="source"
                  name="samda1/iar/system_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samda1/iar/iar/startup_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samda1/iar/iar/samda1j14a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samda1/iar/iar/samda1j14a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMDA1E15B">
         <description>Headers and startup code for Microchip ATSAMDA1E15B</description>
         <files>
            <file condition="C" category="include" name="samda1b/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samda1b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1b/gcc/system_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1b/gcc/gcc/startup_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samda1b/gcc/gcc/samda1e15b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samda1b/gcc/gcc/samda1e15b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_samda1.s"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_samda1.c"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="IAR Exe"
                  category="source"
                  name="samda1b/iar/system_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samda1b/iar/iar/startup_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samda1b/iar/iar/samda1e15b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samda1b/iar/iar/samda1e15b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMDA1J15B">
         <description>Headers and startup code for Microchip ATSAMDA1J15B</description>
         <files>
            <file condition="C" category="include" name="samda1b/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samda1b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samda1b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samda1b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1b/gcc/system_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samda1b/gcc/gcc/startup_samda1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samda1b/gcc/gcc/samda1j15b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samda1b/gcc/gcc/samda1j15b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_samda1.s"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_samda1.c"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="IAR Exe"
                  category="source"
                  name="samda1b/iar/system_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samda1b/iar/iar/startup_samda1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samda1b/iar/iar/samda1j15b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samda1b/iar/iar/samda1j15b_sram.icf"
                  attr="config"/>
         </files>
      </component>
